---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheet.FabricAreaOwnerId
source: html/927f2625-193d-208a-9bb4-4cc3234a6bfe.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.FabricAreaOwnerId Property

The Fabric Area Id.

## Syntax (C#)
```csharp
public ElementId FabricAreaOwnerId { get; }
```